---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.PaperSource
source: html/e3a46d35-cc18-9fb4-e325-fba0de25f471.htm
---
# Autodesk.Revit.DB.PrintParameters.PaperSource Property

The page source.

## Syntax (C#)
```csharp
public PaperSource PaperSource { get; set; }
```

## Remarks
User can select the candidate via PaperSources and then
set the Page source of the Print Setting.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input argument is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the input argument is invalid for current printer.